Repository: pikougi-nabot/epochrefs-old
Catalog: commit/84000/data-translation-memory/toh44-45_84000-the-stem-array.tmx/chapters-54-56.tmx
Source language: bo
Languages: en

source: །ཐབས་དང་ཤེས་རབ་ཏིང་འཛིན་རྣམ་ཐར་དང་། །ཡོན་ཏན་ཀུན་གྱི་མི་ཟད་མཛོད་དུ་གྱུར།
en: May I be an inexhaustible treasure of wisdom, Methods, samādhis, liberations, and all good qualities.

source: །རྡུལ་གཅིག་སྟེང་ན་རྡུལ་སྙེད་ཞིང་རྣམས་ཏེ།
en: There are realms as numerous as atoms in each atom, And while practicing the conduct of enlightenment,

source: །ཞིང་དེར་བསམ་གྱིས་མི་ཁྱབ་སངས་རྒྱས་རྣམས།
en: May I see in those realms countless buddhas

source: །སངས་རྒྱས་སྲས་ཀྱི་དབུས་ན་བཞུགས་པ་ལ།
en: Who are seated in the midst of bodhisattvas.

source: །བྱང་ཆུབ་སྤྱོད་པ་སྤྱོད་ཅིང་བལྟ་བར་བགྱི།
en: May I engage in practicing conduct for an ocean of kalpas

source: །དེ་དག་མ་ལུས་ཐམས་ཅད་ཕྱོགས་སུ་ཡང་།
en: Within every hair’s breadth in every direction, Without exception, in which there are an ocean

source: །སྐྲ་ཙམ་ཁྱོན་ལ་དུས་གསུམ་ཚད་སྙེད་ཀྱི།
en: Of buddhas of the three times, and an ocean of realms.

source: །སངས་རྒྱས་རྒྱ་མཚོ་ཞིང་རྣམས་རྒྱ་མཚོ་དང་། །བསྐལ་པ་རྒྱ་མཚོར་སྤྱོད་ཅིང་རབ་ཏུ་འཇུག །གསུང་གཅིག་ཡན་ལག་རྒྱ་མཚོའི་སྒྲ་སྐད་ཀྱིས།
en: May I always comprehend the speech of the buddhas, Which, through having an ocean of languages in a single syllable,

source: །རྒྱལ་བ་ཀུན་དབྱངས་ཡན་ལག་རྣམ་དག་པ།
en: Has the purity of the aspects of the speech of all the jinas

source: །འགྲོ་བ་ཀུན་གྱི་བསམ་པ་ཇི་བཞིན་དབྱངས།
en: And words that accord with the aspirations of all beings. May I comprehend, through the power of the mind,

source: །སངས་རྒྱས་གསུང་ལ་རྟག་ཏུ་འཇུག་པར་བགྱི།
en: The unceasing sounds of the voices

source: །དུས་གསུམ་གཤེགས་པ་རྒྱས་བ་ཐམས་ཅད་དག །འཁོར་ལོའི་ཚུལ་རྣམས་རབ་ཏུ་བསྐོར་བ་ཡིས། །དེ་དག་གི་ཡང་གསུང་དབྱངས་མྱི་ཟད་ལ།
en: Of the jinas in the three times, Who are turning the wheel in various ways.

source: །བློ་ཡི་སྟོབས་ཀྱིས་བདག་ཀྱང་རབ་ཏུ་འཇུག །མ་འོངས་བསྐལ་བ་ཐམས་ཅད་འཇུག་པར་ཡང་།
en: May I enter all the future kalpas,

source: །སྐད་ཅིག་གཅིག་གིས་བདག་ཀྱང་འཇུག་པར་བགྱི།
en: Entering them in a single instant, And in a fraction of an instant practice

source: །གང་ཡང་བསྐལ་པ་དུས་གསུམ་ཚད་དེ་དག །སྐད་ཅིག་ཆ་ཤས་ཀྱིས་ནི་ཞུགས་པར་སྤྱད།
en: The conduct throughout the kalpas of the three times.

source: །དུས་གསུམ་གཤེགས་པ་མི་ཡི་སེང་གེ་དག །དེ་དག་སྐད་ཅིག་གཅིག་ལ་བདག་གིས་བལྟ།
en: May I in a single instant see The lions among humans in the three times. Through the power of the liberation of being an illusion,

source: །རྟག་ཏུ་དེ་དག་གི་ནི་སྤྱོད་ཡུལ་ལ།
en: May I always enter into their conduct.

source: །སྒྱུ་མར་གྱུར་པའི་རྣམ་ཐར་སྟོབས་ཀྱིས་འཇུག །གང་ཡང་དུས་གསུམ་དག་གི་ཞིང་བཀོད་པ།
en: May the displays of realms in the three times

source: །དེ་དག་རྡུལ་གཅིག་སྟེང་དུ་མངོན་པར་བསྒྲུབ།
en: Be accomplished within a single atom. May I perceive such displays of the realms of the jinas

source: །དེ་ལྟར་མ་ལུས་ཕྱོགས་རྣམས་ཐམས་ཅད་དུ།
en: That are in every direction without exception.

source: །རྒྱལ་བ་རྣམས་ཀྱི་ཞིང་གི་རྒྱན་ལ་འཇུག །གང་ཡང་མ་བྱོན་འཇིག་རྟེན་སྒྲོན་མ་རྣམས།
en: May I go into the presence of all those lords, Those future lamps of the world, who will successively

source: །དེ་དག་རིམ་པར་འཚང་རྒྱ་འཁོར་ལོ་བསྐོར།
en: Attain enlightenment, turn the wheel,

source: །མྱ་ངན་འདས་པ་རབ་ཏུ་ཞི་མཐའ་སྟོན། །མགོན་པོ་ཀུན་གྱི་དྲུང་དུ་བདག་མཆིའོ།
en: And demonstrate the final peace of entering nirvāṇa.

source: །ཀུན་ཏུ་མྱུར་བའི་རྫུ་འཕྲུལ་སྟོབས་རྣམས་དང་། །ཀུན་ནས་སྒོ་ཡི་ཐེག་པའི་སྟོབས་དག་དང་། །ཀུན་ཏུ་ཡོན་ཏན་སྤྱོད་པའི་སྟོབས་རྣམས་དང་། །ཀུན་ཏུ་ཁྱབ་པ་བྱམས་པ་དག་གི་སྟོབས།
en: Through the power of miracles that has complete speed, Through the power of yānas that possesses every gateway, Through the power of conduct that has the complete qualities, Through the power of love that is universal,

source: །ཀུན་ཏུ་དགེ་བའི་བསོད་ནམས་སྟོབས་རྣམས་དང་། །ཆགས་པ་མེད་པར་གྱུར་པའི་ཡེ་ཤེས་སྟོབས།
en: Through the power of merit that has complete goodness, Through the power of knowledge that is without impediment,

source: །ཤེས་རབ་ཐབས་དང་ཏིང་འཛིན་སྟོབས་དག་གིས།
en: Through the power of wisdom, methods, and samādhi,

source: །བྱང་ཆུབ་སྟོབས་རྣམས་ཡང་དག་སྒྲུབ་པར་བྱེད།
en: May I accomplish the power of enlightenment.

source: །ལས་ཀྱི་སྟོབས་རྣམས་ཡོངས་སུ་དག་བྱེད་ཅིང་།
en: May I purify the power of karma,

source: །ཉོན་མོངས་སྟོབས་རྣམས་ཀུན་ཏུ་འཇོམས་པར་བྱེད།
en: Destroy the power of the kleśas,

source: །བདུད་ཀྱི་སྟོབས་རྣམས་སྟོབས་མེད་རབ་བྱེད་ཅིང་།
en: Render powerless the power of the māras,

source: །བཟང་པོ་སྤྱོད་པའི་སྟོབས་ནི་རྫོགས་པར་བགྱི།
en: And make complete all the powers of good conduct.

source: །ཞིང་རྣམས་རྒྱ་མཚོ་རྣམ་པར་དག་བྱེད་ཅིང་།
en: May I purify an ocean of realms,

source: །སེམས་ཅན་རྒྱ་མཚོ་དག་ནི་རྣམ་པར་སྒྲོལ།
en: Liberate an ocean of beings,

source: །ཆོས་རྣམས་རྒྱ་མཚོ་རབ་ཏུ་མཐོང་བྱེད་ཅིང་།
en: See an ocean of the Dharma,

source: །ཡེ་ཤེས་རྒྱ་མཚོ་རབ་ཏུ་རྟོགས་པར་བྱེད།
en: And realize an ocean of knowledge.

source: །སྤྱོད་པ་རྒྱ་མཚོ་རྣམ་པར་དག་བྱེད་ཅིང་།
en: May I purify an ocean of conduct,

source: །སྨོན་ལམ་རྒྱ་མཚོ་རབ་ཏུ་རྫོགས་པར་བྱེད།
en: Fulfill an ocean of prayers,

source: །སངས་རྒྱས་རྒྱ་མཚོ་རབ་ཏུ་མཆོད་བྱེད་ཅིང་།
en: Make offerings to an ocean of buddhas,

source: །བསྐལ་པ་རྒྱ་མཚོར་མི་སྐྱོ་སྤྱད་པར་བགྱི། །གང་ཡང་དུས་གསུམ་གཤེགས་པ་རྒྱལ་བ་ཡི། །བྱང་ཆུབ་སྤྱོད་པའི་སྨོན་ལམ་བྱེ་བྲག་རྣམས།
en: And have tireless conduct for an ocean of kalpas.

source: །བཟང་པོ་སྤྱོད་པས་བྱང་ཆུབ་སངས་རྒྱས་ནས།
en: May I, through good conduct, realize enlightenment

source: །དེ་ཀུན་བདག་གིས་མ་ལུས་རྫོགས་པར་བགྱི།
en: And fulfill, without exception, All the specific prayers of enlightened conduct That are made by the jinas in the three times. I dedicate all this virtue So that I may have the same conduct as that wise one,

source: །རྒྱལ་བ་ཀུན་གྱི་སྲས་ཀྱི་ཐུ་བོ་བ།
en: The eldest son of all the jinas,

source: །གང་གི་མིང་ནི་ཀུན་ཏུ་བཟང་ཞེས་བྱ།
en: Whose name is Samanta­bhadra.

source: །མཁས་པ་དེ་དང་མཚུངས་པར་སྤྱད་པའི་ཕྱིར། །དགེ་བ་འདི་དག་ཐམས་ཅད་རབ་ཏུ་བསྔོ།
en: Just as the good wise one made a dedication

source: །ལུས་དང་ངག་དང་ཡིད་ཀྱང་རྣམ་དག་ཅིང་།
en: For a pure body, speech, and mind,

source: །སྤྱོད་པ་རྣམ་དག་ཞིང་རྣམས་ཡོངས་དག་དང་། །བསྔོ་བ་བཟང་པོ་མཁས་པ་ཅི་འདྲ་བར།
en: A pure conduct, and a pure realm,

source: །དེ་འདྲར་བདག་ཀྱང་དེ་དང་མཚུངས་པར་ཤོག །ཀུན་ནས་དགེ་བ་བཟང་པོ་སྤྱོད་པའི་ཕྱིར།
en: May it be the same for me.

source: །འཇམ་དཔལ་གྱི་ནི་སྨོན་ལམ་སྤྱད་པར་བགྱི།
en: May I practice the conduct of Mañjuśrī’s prayer For good conduct, for complete goodness,

source: །མ་འོངས་བསྐལ་པ་ཀུན་ཏུ་མི་སྐྱོ་བར།
en: Without weariness throughout the kalpas to come.

source: །དེ་ཡི་བྱ་བ་མ་ལུས་རྫོགས་པར་བགྱི།
en: May I complete all those activities without exception.

source: །སྤྱོད་པ་དག་ནི་ཚད་ཡོད་མ་གྱུར་ཅིག །ཡོན་ཏན་རྣམས་ཀྱང་ཚད་གཟུང་མེད་པར་ཤོག །སྤྱོད་པ་ཚད་མེད་པ་ལ་གནས་ནས་ཀྱང་།
en: May there be no limit to that conduct; May there be no limit to those good qualities, And having maintained a conduct that has no limit,

source: །དེ་དག་འཕྲུལ་པ་ཐམས་ཅད་འཚལ་བར་བགྱི།
en: May I give rise to all those miraculous powers.

source: །ནམ་མཁའི་མཐར་ཐུག་གྱུར་པ་ཇི་ཙམ་པར།
en: If there were an end to space,

source: །སེམས་ཅན་མ་ལུས་མཐའ་ཡང་དེ་བཞིན་ཏེ།
en: There would be an end to all beings.

source: །ཅི་ཙམ་ལས་དང་ཉོན་མོངས་མཐར་གྱུར་པ།
en: Only when their karma and kleśas end

source: །བདག་གི་སྨོན་ལམ་མཐའ་ཡང་དེ་ཙམ་མོ།
en: Will my prayers also come to an end.

source: །གང་ཡང་ཕྱོགས་བཅུའི་ཞིང་རྣམས་མཐའ་ཡས་པ། །རིན་ཆེན་བརྒྱན་ཏེ་རྒྱལ་བ་རྣམས་ལ་ཕུལ།
en: If someone offered to the jinas the endless realms In the ten directions adorned with jewels

source: །ལྷ་དང་མི་ཡི་བདེ་བ་མཆོག་རྣམས་ཀྱང་།
en: And the most excellent pleasures of devas and humans

source: །ཞིང་གི་རྡུལ་སྙེད་བསྐལ་བར་ཕུལ་བ་བས།
en: For kalpas as numerous as the atoms in a realm,

source: །གང་གིས་བསྔོ་བའི་རྒྱལ་པོ་འདི་ཐོས་ནས།
en: Someone who has faith just once On hearing this king of dedications

source: །བྱང་ཆུབ་མཆོག་གི་རྗེས་སུ་རབ་མོས་ཤིང་། །ལན་ཅིག་ཙམ་ཡང་དད་པ་བསྐྱེད་པས་ནི།
en: And aspires to attain perfect enlightenment

source: །བསོད་ནམས་དམ་པའི་མཆོག་ཏུ་འདི་འགྱུར་རོ།
en: Will have a higher, superior merit.

source: །གང་གིས་བཟང་སྤྱོད་སྨོན་ལམ་འདི་བཏབ་པ།
en: Whoever recites this prayer for good conduct

source: །དེས་ནི་ངན་སོང་ཐམས་ཅད་སྤོང་བར་འགྱུར།
en: Will be free from all lower existences,

source: །དེས་ནི་གྲོགས་པོ་ངན་པ་སྤངས་པ་ཡིན།
en: Will be free from bad companions,

source: །སྣང་བ་མཐའ་ཡས་དེ་ཡང་དེས་མྱུར་མཐོང་།
en: And will quickly see Amitābha.

source: །དེ་དག་རྙེད་པ་རབ་རྙེད་བདེ་བར་འཚོ།
en: They will have in this life the good fortune

source: །མི་ཚེ་འདིར་ཡང་དེ་དག་ལེགས་པར་འོང་།
en: Of obtaining success, a happy life, And will soon become

source: །ཀུན་ཏུ་བཟང་པོ་དེ་ཡང་ཇི་འདྲ་བར། །དེ་དག་རིང་པོར་མི་ཐོགས་དེ་བཞིན་འགྱུར།
en: The same as Samanta­bhadra.

source: །མཚམས་མེད་ལྔ་པོ་དག་གི་སྡིག་པ་རྣམས། །གང་གི་མི་ཤེས་དབང་གིས་བྱས་པ་དག །དེ་ཡིས་བཟང་པོ་སྤྱོད་པ་འདི་བརྗོད་ན། །མྱུར་དུ་མ་ལུས་ཡོངས་སུ་བྱང་བར་འགྱུར།
en: If someone through the power of ignorance Has the bad karma of the five actions with immediate results, They will be purified of it, without any remainder Through reciting this prayer for good conduct.

source: །ཡེ་ཤེས་དང་ནི་གཟུགས་དང་མཚན་རྣམས་དང་། །རིགས་དང་ཁ་དོག་རྣམས་དང་ལྡན་པར་འགྱུར།
en: They will have the wisdom, form, Features , family, and color,

source: །བདུད་དང་མུ་སྟེགས་མང་པོས་དེ་མྱི་ཐུབ།
en: Be invincible to hosts of māras and tīrthikas,

source: །འཇིག་རྟེན་གསུམ་པོ་ཀུན་ནའང་མཆོད་པར་འགྱུར།
en: And be offered to by the entire three realms.

source: །བྱང་ཆུབ་ཤིང་དབང་དྲུང་དུ་དེ་མྱུར་འགྲོ།
en: They will soon go to the Bodhi tree, the lord of trees,

source: །སོང་ནས་སེམས་ཅན་ཕན་ཕྱིར་དེར་འདུག་སྟེ།
en: And having reached there be seated for the benefit of beings,

source: །བྱང་ཆུབ་སངས་རྒྱས་འཁོར་ལོ་རབ་ཏུ་བསྐོར།
en: Become enlightened in buddhahood, turn the wheel of the Dharma,

source: །བདུད་རྣམས་སྡེ་དང་བཅས་པ་ཐམས་ཅད་བཏུལ།
en: And overpower Māra and his entire army. The Buddha knows the result that ripens

source: །གང་ཡང་བཟང་པོ་སྤྱོད་པའི་སྨོན་ལམ་འདི། །འཆང་བ་དང་ནི་ཀློག་གམ་སྟོན་པ་ཡི། །དེ་ཡི་རྣམ་པར་སྨིན་པ་སངས་རྒྱས་མཁྱེན།
en: For the one who possesses, recites, Or teaches this prayer for good conduct.

source: །བྱང་ཆུབ་མཆོག་ལ་སོམ་ཉི་མ་བྱེད་ཅིག །འཇམ་དཔལ་ཇི་ལྟར་མཁྱེན་ཅིང་དཔའ་བ་དང་། །ཀུན་ཏུ་བཟང་པོ་དེ་ཡང་དེ་བཞིན་ཏེ།
en: Do not doubt the supreme enlightenment! Just as the hero Mañjuśrī knows, In that way so does Samanta­bhadra.

source: །དེ་དག་གི་ནི་རྗེས་སུ་བདག་སློབ་ཅིང་།
en: In practicing in the same way as they do,

source: །དགེ་བ་འདི་དག་ཐམས་ཅད་རབ་ཏུ་བསྔོ།
en: I am dedicating all this merit. With the prayer that is praised as supreme

source: །དུས་གསུམ་གཤེགས་པ་རྒྱལ་བ་ཐམས་ཅད་ཀྱིས།
en: By all the jinas in the three times,

source: །བསྔོ་བ་གང་ལ་མཆོག་ཏུ་བསྔགས་པ་དེས། །བདག་གི་དགེ་བའི་རྩ་བ་འདི་ཀུན་ཀྱང་།
en: I am dedicating all this merit

source: །བཟང་པོ་སྤྱོད་ཕྱིར་རབ་ཏུ་བསྔོ་བར་བགྱི།
en: For the supreme good conduct.

source: །བདག་ནི་འཆི་བའི་དུས་བྱེད་གྱུར་པ་ན།
en: When the time has come for me to die,

source: །སྒྲིབ་པ་ཐམས་ཅད་དག་ནི་ཕྱིར་བསྩལ་ཏེ།
en: May I dispel all obscurations,

source: །མངོན་སུམ་སྣང་བ་མཐའ་ཡས་དེ་མཐོང་ནས།
en: See Amitābha before me,

source: །བདེ་བ་ཅན་གྱི་ཞིང་དེར་རབ་ཏུ་འགྲོ།
en: And go to the Sukhāvatī realm.

source: །དེར་སོང་ནས་ནི་སྨོན་ལམ་འདི་དག་ཀྱང་།
en: When I have gone there, may these prayers

source: །ཐམས་ཅད་མ་ལུས་མངོན་དུ་གྱུར་པར་ཤོག །དེ་དག་མ་ལུས་བདག་གིས་ཡོངས་སུ་བསྐང་།
en: All become completely manifest. May I fulfill them all without exception

source: །འཇིག་རྟེན་ཇི་སྲིད་སེམས་ཅན་ཕན་པར་བགྱི།
en: And benefit beings for as long as there are worlds.

source: །རྒྱལ་པའི་དཀྱིལ་འཁོར་བཟང་ཞིང་དགའ་བ་དེར།
en: May I be born from a beautiful, perfect lotus

source: །པད་མོ་དམ་པ་ཤིན་ཏུ་མཛེས་ལས་སྐྱེས།
en: In that pleasant, beautiful circle of the jinas, And there obtain my prophecy

source: །སྣང་བ་མཐའ་ཡས་རྒྱལ་བས་མངོན་སུམ་དུ།
en: Directly from the Jina Amitābha.

source: །ལུང་བསྟན་པ་ཡང་བདག་གིས་དེར་ཐོབ་ཤོག །དེར་ནི་བདག་གིས་ལུང་བསྟན་རབ་ཐོབ་ནས། །སྤྲུལ་པ་མང་པོ་བྱེ་བ་ཕྲག་བརྒྱ་ཡིས།
en: Having obtained there the prophecy,

source: །བློའི་སྟོབས་ཀྱིས་ཕྱོགས་བཅུ་རྣམས་སུ་ཡང་། །སེམས་ཅན་རྣམས་ལ་ཕན་པ་མང་པོ་བགྱི། །གང་གིས་བཟང་པོ་སྤྱོད་པ་སྟོན་པ་ཡིས།
en: May I through the power of mind Bring many benefits to beings in the ten directions Through many billions of emanations.

source: །དགེ་བ་ཅུང་ཟད་བདག་གིས་ཅི་བསྩགས་པ།
en: May what little merit I have accumulated Through reciting the good conduct prayer

source: །དེས་ནི་འགྲོ་བའི་སྨོན་ལམ་དགེ་བ་རྣམས།
en: Cause the virtuous prayers of beings

source: །སྐད་ཅིག་གཅིག་གིས་ཐམས་ཅད་འབྱོར་བར་ཤོག །གང་ཡང་བཟང་པོ་སྤྱོད་པ་བསྔོས་པ་ཡིས།
en: All to be fulfilled in an instant.

source: །བསོད་ནམས་མཐའ་ཡས་དམ་པ་ཐོབ་པ་དེས།
en: Through the sublime, endless merit attained By my dedicating the good conduct,

source: །འགྲོ་བ་སྡུག་བསྔལ་ཆུ་བོར་བྱིང་བ་རྣམས།
en: May the beings drowning in a river of suffering

source: །འོད་དཔག་མེད་པའི་གནས་རབ་འགྲོ་བར་ཤོག
en: Depart to the supreme residence of Amitābha.

source: །ཤིན་ཏུ་རྒྱས་པ་ཆེན་པོའི་མདོ། །སངས་རྒྱས་ཕལ་པོ་ཆེ་ཞེས་བྱ་བ་ལས། བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཀྱི་ནང་། སྡོང་པོས་བརྒྱན་པ་ཞེས་བྱ་བ་ཆོས་ཀྱི་རྣམ་གྲངས་ཆེན་པོ་ལས། ནོར་བཟངས་ཀྱིས་དགེ་བའི་བཤེས་གཉེན་བསྙེན་བཀུར་བའི་སྤྱོད་པ་ཕྱོགས་གཅིག་སྟེ་ཅི་སྙེད་པ་རྫོགས་སྷོ།།
en: The compilation of Sudhana’s conduct of honoring kalyāṇamitras from the great Dharma teaching entitled “Stem Array” from within the “Bodhisattva­piṭaka,” “The Mahāvaipulya Sūtra Entitled ‘A Multitude of Buddhas,’ ” is concluded. This concludes the episodes of Sudhana’s conduct of honoring kalyāṇamitras from the great Dharma teaching, “The Stem Array.”

source: །།རྒྱ་གར་གྱི་མཁན་པོ་ཛི་ན་མི་ཏྲ་དང་། སུ་རེནྡྲ་བོ་དྷི་དང་། ཞུས་ཆེན་གྱི་ལོ་ཙཱ་བ་བནྡེ་ཡེ་ཤེས་སྡེ། ལ་སོགས་པས་བསྒྱུར་ཅིང་ཞུས་ཏེ་གཏན་ལ་ཕབ་པའོ།།
en: Colophon This was translated and revised by the Indian upādhyāyas Jinamitra and Surendrabodhi and by the chief editor Lotsawa Bandé Yeshé Dé and others.

source: །།དེ་ལྟར་བདེ་བར་གཤེགས་པའི་བཀའ་འཁོར་ལོ་རིམ་པ་གསུམ་ལས། འདིར་ཐ་མ་དོན་དམ་རྣམ་པར་ངེས་པའི་འཁོར་ལོའི་སྙིང་པོ་ཕུལ་དུ་བྱུང་བ་སངས་རྒྱས་ཕལ་པོ་ཆེ་མཚན་གྱི་རྣམ་གྲངས་ཤིན་ཏུ་རྒྱས་པ་ཆེན་པོའི་སྡེ་སྣོད།
en: A Multitude of Buddhas is the marvelous essence of the final, ultimate, definitive wheel from among the three wheels of the Sugata’s teaching.

source: སྙན་གྱི་གོང་རྒྱན། པདྨའི་རྒྱན་སོགས་དུ་མ་དང་ལྡན་པ་ལ། དེ་བཞིན་གཤེགས་པ་ཕལ་པོ་ཆེའི་ལེའུ། རྡོ་རྗེ་རྒྱལ་མཚན་གྱི་བསྔོ་བ།
en: It has many other titles, such as The Mahāvaipulya Basket , The Earring , The Lotus Adornment , and so on.

source: ས་བཅུ་བསྟན་པ། ཀུན་ཏུ་བཟང་པོའི་སྤྱོད་པ་བསྟན་པ། དེ་བཞིན་གཤེགས་པའི་སྐྱེ་བ་དང་འབྱུང་བ་བསྟན་པ། འཇིག་རྟེན་ལས་འདས་པའི་ལེའུ། སྡོང་པོས་བརྒྱན་པའི་ལེའུ་སྟེ་བདུན་ལ་སོ་སོའི་ནང་གསེས་ཀྱི་དབྱེ་བས་ལེའུ་བཞི་བཅུ་རྩ་ལྔ།
en: It has seven sections: A Multitude of Tathāgatas , The Vajra Banner Dedication , The Teaching of the Ten Bhūmis , The Teaching of Completely Good Conduct , The Teaching of the Birth and Appearance of the Tathāgatas , The Transcendence of the World , and Stem Array . These are subdivided into forty-five chapters.

source: ཤློ་ཀ་སུམ་ཁྲི། དགུ་སྟོང་སུམ་ཅུ། བམ་པོ་བརྒྱ་སུམ་ཅུ་དང་ཤློ་ཀ་སུམ་ཅུ་ཡོད་པར་བུ་སྟོན་རིན་པོ་ཆེ་སོགས་བཞེད་ཅིང་།
en: According to Butön Rinpoché and others, it contains thirty-nine thousand and thirty verses, a hundred and thirty fascicles, and an additional thirty verses.

source: ཚལ་པ་བཀའ་འགྱུར་གྱི་དཀར་ཆག་ཏུ་བམ་པོ་བརྒྱ་དང་བཅོ་ལྔ། ལྡན་དཀར་མར་བམ་པོ་བརྒྱ་དང་ཉི་ཤུ་རྩ་བདུན་དུ་མཛད། དེང་སང་གི་དཔེ་རྣམས་ལའང་བམ་གྲངས་མང་ཉུང་ཅི་རིགས་ཡོད་པར་སྣང་།
en: In the Tshalpa Kangyur edition there are a hundred and fifteen fascicles, the Denkarma edition has a hundred and twenty-seven fascicles, and present-day editions have various numbers of fascicles.

source: འདི་ཐོག་མར་འཕགས་པ་ཀླུ་སྒྲུབ་ལ། པཎྜི་ཏ་བྱང་ཆུབ་བཟང་པོ་དང་པཎྜི་ཏ་དགའ་བ་གཉིས་ཀྱིས་ཞུས། དེ་གཉིས་ཀས་རྒྱ་ནག་ཏུ་འགྱུར་མཛད།
en: This sūtra was first received from Ārya Nāgārjuna by Paṇḍita Buddhabhadra and Paṇḍita Śikṣānanda (65 –710), and they both translated it into Chinese.

source: རྒྱ་ནག་གི་འགྱུར་ལ། སུ་རེནྟྲ་བོ་དྷི་དང་། བཻ་རོ་ཙ་ན་རཀྵི་ཏས་ཞུས་ཆེན་མཛད་པར་བཤད་ཅིང་།
en: It is taught that Surendrabodhi and Vairocana­rakṣita became principal editors for a Chinese translation.

source: ལུང་གི་བརྒྱུད་རིམ་ལའང་རྒྱ་ནག་ནས་འགྱུར་བའི་བརྒྱུད་པ་ནི།
en: As for the lineage of the text, there is the lineage from China:

source: རྫོགས་པའི་སངས་རྒྱས། འཕགས་པ་འཇམ་དཔལ། མགོན་པོ་ཀླུ་སྒྲུབ། གོང་གི་པཎྜི་ཏ་གཉིས།
en: The perfect Buddha, Ārya Mañjuśrī, Lord Nāgārjuna, the two paṇḍitas mentioned above, and Heshang Tushun.

source: དེ་ནས་ཧྭ་ཤང་ཐུ་ཐུ་ཞུན་སོགས་རིམ་པར་བརྒྱུད་དེ། ཧྭ་ཤང་གྱིང་ཇུ་ལ་དབུས་པ་སངས་རྒྱས་འབུམ་གྱིས་གསན།
en: Then the lineage continued through others until Üpa Sangyé Bum received it from Heshang Gying-ju.

source: དེ་ནས་ལོ་ཙཱ་བ་མཆོག་ལྡན་ནས་དེང་སང་གི་བར་དུ་བརྒྱུད་པ་དང་། རྒྱ་གར་ནས་འགྱུར་བའི་བརྒྱུད་པ་ནི།
en: Then that lineage was passed on through Lotsawa Chokden and has continued up to the present time. The lineage from India is as follows:

source: ཀླུ་སྒྲུབ་ནས། ཨཪྻ་དེ་ཝ། འཇམ་དཔལ་གྲགས་པ་སོགས་ནས་རིམ་བཞིན། རྡོ་རྗེ་གདན་བ་རི་ལོ་ཙཱ་བས་གསན།
en: It was passed from Nāgārjuna to Āryadeva, and then Mañjuśrīkīrti, and so on, until Bari Lotsawa received it from Vajrāsana.

source: དེ་ནས་མཆིམས་བརྩོན་སེང་།
en: It is taught that the lineage then continued through Chim Tsöndrü

source: རྗེ་བཙུན་ས་སྐྱ་པ་ཆེན་པོ་སོགས་བརྒྱུད་པར་བཤད་དོ།
en: Sengé, the great Sakya Lord, and so on.

source: །འོན་ཀྱང་གོང་གི་འགྱུར་བྱང་འདི་ལས་ལོ་པཎ་གཞན་གྱིས་བསྒྱུར་ཚུལ་ལོ་རྒྱུས་དང་། དཔེ་རྣམས་ལ་མ་མཐོང་ངོ་།
en: However, I have not seen any other text or history of a translation made by any other lotsawa or paṇḍita other than those listed in the colophon to this translation into Tibetan.

source: །འདི་ཉིད་ཚལ་བ་བཀའ་འགྱུར་གྱི་མ་ཕྱི་བྱས་ནས་འཇང་ས་ཐམ་རྒྱལ་པོས་བཀའ་འགྱུར་རོ་ཅོག་པར་དུ་བསྒྲུབས་པ་དེང་སང་ལི་ཐང་མཆལ་བར་དུ་གྲགས་པ་ཁུངས་ཐུབ་ཀྱི་ཚད་མར་བཟུང་ནས་མ་ཕྱི་བྱས་པ་ཡིན་ཀྱང་།
en: The king of Jangsa Tham had a complete Kangyur made that was based on the Tshalpa Kangyur. At the present time this is known as the Lithang Tshalpa Kangyur (1609–14). I considered this to be a reliable source and so have made it the basis for this edition.

source: སྐབས་འདིར་ཆད་ལྷག་དང་བརྡ་མ་དག་པ་མང་བ་འདུག་པས། སླར་ཡིག་རྙིང་དག་པ་མང་དུ་བཙལ་ནས་ཞུ་དག་བགྱིས་པ་ཡིན་ལ།
en: However, it has many omissions, accretions, and misspellings, and therefore I have at this time corrected it by seeking out many older editions.

source: དེའང་རྒྱ་དཔེ་མི་གཅིག་པ་དང་། འགྱུར་མི་མཐུན་པ་ནི་དོན་གྱི་ཁོག་གཅིག་ཀྱང་ཚིག་ལ་ཞུ་དག་མི་བཏུབ་ནའང་།
en: There are variant Indian texts and conflicting translations, and I have not been able to ascertain from them a definitive single meaning or correct words.

source: འདིའི་དཔེ་ཕལ་ཆེར་ཞུ་དག་ཕེར་བ་ཁོ་ན་འདུག་ལ་འོན་ཀྱང་རྒྱན་ལ་བཀོད་པ་དང་། འབྱམ་ཀླས་ལ་རབ་འབྱམས་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་ལ། ཐ་དད་པ་ཡང་དག་པར་ཤེས་པ་དང་། ཐུགས་ལ་དགོངས་པ་དང་། ཉིན་མཚན་དང་ཟླ་བ་ཡར་ཁམ་མར་ཁམ་དང་ཞེས་པ་ལ།
en: Nevertheless, this text is nothing but a valid edition.

source: ཉིན་མཚན་དང་ཡུད་དུ་ཡན་མན་དང་ཞེས་དང་། ཐ་སྙད་ལ་རྣམ་པར་དཔྱོད་པ་ཞེས་པ་རྣམས་འགྱུར་ཁྱད་ལྟ་བུར་འདུག་པ་དོན་ལ་མི་འགལ་བས་རང་སོར་བཞག །རྒྱ་སྐད་ལ་རང་བཞིན་རྐྱེན།
en: There are varying translations of terms that have been left unrevised, as there is no contradiction in meaning. For example, it has rgyan instead of bkod pa ; ’byam klas instead of rab ’byams ; so so yang dag par rig pa instead of tha dad pa yang dag par shes pa ; thugs for dgongs pa ; nyin mtshan dang zla ba yar kham mar kham dang instead of nyin mtshan dang yud du yan man dang ; and tha snyad instead of rnam par dpyod pa

source: རྣམ་འགྱུར་གྱི་ཚུལ་དུ་མ་ཡོད་པ། བོད་ལ་ལོ་པཎ་ཆོས་ཀྱི་སྤྱན་ལྡན་རྣམས་ཀྱིས་དོན་འགྱུར་མཛད་པ་འགའ་ཞིག །དུས་དང་རྣམ་དབྱེ་སོགས་ཤིན་ཏུ་རྟོགས་དཀའ་བས་དཔེ་མཐུན་ཤས་ཆེ་བ་གཙོ་བོར་བཟུང་།
en: Sanskrit words have many cases and tenses, so that although the Tibetan lotsawas and paṇḍitas, who had the eyes of the Dharma, translated their meaning, their tenses, cases, and so on are difficult to discern.

source: གཞན་དོགས་གནས་ཅུང་ཟད་ཡོད་པ་རྣམས། བོད་ཀྱི་བརྡའི་བསྟན་བཅོས་རྣམས་དང་གོ་བསྟུན། དཔེ་ཕལ་ཆེར་ལ་བརྡ་རྙིང་ཤས་ཆེ་བ་དང་། འགྱུར་བཅོས་མཛད་པའི་གསལ་ཁ་མི་སྣང་བས།
en: Those are the majority of the examples of uncertainty, and there are also a few other kinds, but they are nevertheless in accord with Tibetan grammar.

source: བོད་ཀྱི་བརྡ་རྙིང་པ་ཤ་སྟག་ཞིག་བྱུང་ན་འབྲེལ་ཆགས་པ་འདྲ་ཡང་ཕྱིས་སུ་བརྡ་གསར་རྙིང་འདྲེས་ཉམས་ཆེ་བ་དང་། ཤད་བར་གཅོད་མཚམས་འཁྲུགས་པ་མང་དུ་སྣང་ཡང་ཅུང་ཟད་སྐྱོན་ཆུང་བའི་དབང་དུ་བྱས་ནས་བཏང་སྙོམས་སུ་བཞག །དེ་མིན་མོན་པའི་རྡོ་གཅོད་ཞུ་དག་གི་དཔེ་ཟླར་མ་སོང་བར་ནན་ཏན་ཆེན་པོས་ཤིན་ཏུ་དག་ཁུལ་དུ་བགྱིས་པ་འདི།
en: In most texts there are many archaic words, so that the meaning of the translation is not clear, but there is a consistency when those words are all in archaic Tibetan. However, there appears to have occurred in later times a strong adulteration of the text so that there is a mixture of archaic and modern forms. There are also unreliable placements of the shad mark that differentiates clauses, but all these have been left as they are because these faults are few and minor. Therefore, this revision has been diligently edited without becoming analogous to knocking down the ancient megaliths of the southern regions.

source: སངས་རྒྱས་ཀྱི་བསྟན་པ་རིན་པོ་ཆེ་དང་རིས་མེད་པའི་འགྲོ་བ་ཡོངས་ཀྱི་བསོད་ནམས་ཀྱི་དཔལ་དུ་བསྐལ་བ་ཇི་སྲིད་གནས་ཀྱི་བར་དུ་ཁོར་ཡུག་རི་བོའི་ཁོངས་འདིར།
en: May this remain for the entire kalpa within the circle of the Cakravāla Mountains, as bright as the sun and moon, as the glory of the merit of nonsectarian beings and the precious teaching of the Buddha.

source: ཉི་ཟླ་ལྟར་གསལ་བར་གྱུར་ཅིག །ཅེས་བོད་ཆེན་པོའི་ཡུལ་ལྗོངས་སྡེ་བཞིའི་འབྱུང་གནས་དགེ་བཅུའི་ཁྲིམས་ལུགས་ཀྱིས་མངོན་པར་མཐོ་བའི་ནོར་འཛིན་ཡངས་པ་ཆོས་བཞིན་དུ་སྐྱོང་བའི་ལྷ་ཆོས་རྒྱལ་བྱང་ཆུབ་སེམས་དཔའི་མིའི་དབང་པོ་བསྟན་པ་ཚེ་རིངས་ཀྱི་ཞལ་སྔ་ནས།
en: This was printed in the water tiger year called dge byed (17 ), in the presence of Tenpa Tsering (1678–1738), the divine Dharma king who rules in accordance with the Dharma, who has the vast, superior wealth of the ten good actions, and who is a bodhisattva as a ruler of humans and the source of happiness in the four regions of greater Tibet.

source: དགེ་བྱེད་ཅེས་པ་ཆུ་སྟག་ལོར་གསུང་རབ་འདི་ཉིད་པར་དུ་བསྒྲུབ་པར་མཛད་པའི་སྐབས་ཞུ་དག་ལས་འཕྲོས་ཏེ་འདི་ཉིད་ཀྱི་དོ་དམ་པར་བཀས་གནང་བའི་ཞབས་འབྲིང་བ་དགེ་སློང་བཀྲ་ཤིས་དབང་ཕྱུག་གིས་གླེང་བ་ཛ་ཡནྟུ།།
en: This was written by the attendant Gelong Tashi Wangchuk, who in the process of revision was commanded to become its supervisor.

source: །།ཡེ་དྷརྨྨཱ་ཧེ་ཏུ་བྲབྷ་ཝཱ་ཧེ་ཏུནྟེ་ཥཱནྟ་ཐཱ་ག་ཏོ་ཧྱ་ཝད་ཏ།
en: Ye dharma­hetu­prabhavā hetun teṣān tathāgato hy avadat.
